src/InformationRegisters/НастройкиИмпортаВыписок/НастройкиИмпортаВыписок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиИмпортаВыписок</name>
  <resources>
    <name>КатегорияОпераций</name>
    <type>
      <types>CatalogRef.КатегорииОпераций</types>
    </type>
  </resources>
  <resources>
    <name>Реквизиты</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиДДС</types>
    </type>
  </resources>
  <resources>
    <name>АлгоритмРасчета</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ИспользуетсяАлгоритмРасчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ПредставлениеПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ВидОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПриходРасход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПлательщикИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПолучательИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПоказательКБК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СтрокаПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НастройкиИмпортаВыписок/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриоритетНаСервере(Данные, Выше)
	
	Если Данные.Приоритет = 1 И Выше Тогда
		Возврат;
	КонецЕсли;
	
	Набор = РегистрыСведений.НастройкиИмпортаВыписок.СоздатьНаборЗаписей();
	Набор.Прочитать();
	
	Если Данные.Приоритет = Набор.Количество() И НЕ Выше Тогда
		Возврат;
	КонецЕсли;
	
	ВременныйНомер = 10000;
	НомерНовогоПриоритета = Данные.Приоритет + (?(Выше, -1, 1));
	
	Для Каждого Запись Из Набор Цикл
		
		Если Запись.Приоритет = НомерНовогоПриоритета Тогда
			Запись.Приоритет = ВременныйНомер;
			Прервать;
		КонецЕсли;
	
	КонецЦикла;
	
	Для Каждого Запись Из Набор Цикл
		
		Если Запись.Приоритет = Данные.Приоритет Тогда
			Запись.Приоритет = НомерНовогоПриоритета;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Запись Из Набор Цикл
		
		Если Запись.Приоритет = ВременныйНомер Тогда
			Запись.Приоритет = Данные.Приоритет;
			Прервать;
		КонецЕсли;
	
	КонецЦикла;
	
	ТаблицаСортировки = Набор.Выгрузить();
	ТаблицаСортировки.Сортировать("Приоритет УБЫВ");
	
	т = ТаблицаСортировки.Количество();
	Для Каждого СтрокаТЗ Из ТаблицаСортировки Цикл
		СтрокаТЗ.Приоритет = т;
		т = т - 1;		
	КонецЦикла;
	
	Набор.Загрузить(ТаблицаСортировки);
	Набор.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриоритетВыше(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		СтруктураДанных = Новый Структура(СтруктураДанных());
		ЗаполнитьЗначенияСвойств(СтруктураДанных, ТекущиеДанные);
		ПриоритетНаСервере(СтруктураДанных, Истина);
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриоритетНиже(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		СтруктураДанных = Новый Структура(СтруктураДанных());
		ЗаполнитьЗначенияСвойств(СтруктураДанных, ТекущиеДанные);
		ПриоритетНаСервере(СтруктураДанных, Ложь);
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СтруктураДанных()
	Возврат(Новый ФиксированнаяСтруктура("ВидОплаты, ПриходРасход, ПлательщикИНН, ПолучательИНН, ПоказательКБК, СтрокаПоиска, Приоритет"));	
КонецФункции
